Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьВСпискеВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
		
		Если ПользовательИБ = Неопределено Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
			ОбновитьДанныеПользователяИБ(ПользовательИБ);
			
			ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
			
		Иначе
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст("В списке уже есть пользователь с данным именем!");
			Сообщение.Сообщить();
		КонецЕсли;
		
	Иначе
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		Если ПользовательИБ <> Неопределено Тогда
			ОбновитьДанныеПользователяИБ(ПользовательИБ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДанныеПользователяИБ(ПользовательИБ)
	ПользовательИБ.Имя = Наименование;
	ПользовательИБ.ПолноеИмя = ПолноеИмя;
	ПользовательИБ.ПоказыватьВСпискеВыбора = ПоказыватьВСпискеВыбора;
	
	Если ДополнительныеСвойства.Свойство("СписокРолей") Тогда
		ПользовательИБ.Роли.Очистить();
		СписокРолей = ДополнительныеСвойства.СписокРолей;
		
		Для Каждого Роль Из СписокРолей Цикл
			
			Если Роль.Пометка Тогда
				ИмяРоли = Роль.Значение;
				ПользовательИБ.Роли.Добавить(Метаданные.Роли[ИмяРоли]);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПользовательИБ.Записать();
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	Если Пользователь = Неопределено Тогда
		Сообщить("Пользователь с данным именем не найден в базе");
		Отказ = Истина;
	Иначе
		Пользователь.Удалить();
		Сообщить("Пользователь " + Наименование + " удален");
	КонецЕсли;
КонецПроцедуры
